<template>
  <footer class="resp-footer">
    <div
      class="footer-img"
      :style="{ display: route.name === 'home' ? 'block' : 'none' }"
    >
      <img
        src="/src/assets/images/sm-images/footerResp.jpg"
        style="
          width: 100%;
          height: auto;
          filter: brightness(0.5);
          min-height: 300px;
        "
        alt=""
      />
      <div class="footer-resp--text">
        <p class="footer-title head-secondary">احجز استشارتك القانونية</p>
        <p class="footer-text body-desc-secondary">
          حرصًا منا على متابعة المستجدات القانونية، ومنح الاستشارات أو التوصيات
          أو الخدمات من قبل خبراء قانونيين، نسعد بخدمتكم، في جميع فروعنا، ساعات
          العمل من الثامنة صباحًا إلى الخامسة مساءً.
        </p>
        <button class="btn-round-primary">التواصل مع فريق الجبيري</button>
      </div>
    </div>
    <!-- logo col -->
    <div class="footer-col p-5">
      <router-link to="/">
        <svg
          width="64"
          height="65"
          viewBox="0 0 64 65"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clip-path="url(#clip0_812_12196)">
            <path
              d="M-0.400391 64.2549H63.5996V0.254883H-0.400391V64.2549ZM2.46079 61.3937V3.11606H28.8137L26.3541 6.52939C26.3541 6.52939 22.9408 11.1976 26.8561 14.5608L33.3816 20.1827C33.0804 20.2831 32.8796 20.2831 32.8796 20.2831C31.3235 20.5843 29.7173 21.1866 28.362 22.0902L25.551 19.6808C25.551 19.6808 24.3965 18.6768 23.3925 17.5725C22.74 16.8196 21.8365 15.7655 22.6898 13.8078C22.8404 13.4565 23.0914 13.1051 23.3424 12.7035L22.3886 11.8502L19.6278 15.6149C19.6278 15.6149 16.2145 20.2831 20.1298 23.6463L23.5431 26.6078C23.1918 27.0094 23.0412 27.2604 23.0412 27.2604L21.4349 29.4188C21.4349 29.4188 19.4271 32.3804 20.0294 35.6431C20.18 36.5466 20.8326 39.0063 24.0451 41.767L32.1267 48.6941L33.9337 46.1843C35.8914 43.2227 33.7831 41.4659 33.7831 41.4659L26.2537 34.9906C26.2537 34.9906 21.8365 31.2259 24.0953 28.1137C24.1957 27.9129 24.3965 27.6619 24.6474 27.4612L26.6553 29.218L36.5439 37.7012C36.5439 37.7012 41.7141 42.1686 37.3471 48.1419L32.3275 55.069L19.6278 44.1263C19.6278 44.1263 15.8631 40.8635 17.4694 37.2494L16.5157 36.3961L14.7086 38.8557C14.7086 38.8557 12.8012 41.4659 13.4035 44.7286C13.5541 45.6321 14.2067 48.0918 17.4192 50.8525L29.5667 61.2933H2.46079V61.3937ZM60.6882 61.3937H42.4671L46.3322 56.5749L41.3628 52.4588L37.4976 57.378L42.2663 61.3937H29.7173L39.1541 48.4431L41.3125 45.4816C41.3125 45.4816 42.3165 44.0761 42.969 42.3694C43.8725 39.8094 44.0231 35.4925 39.2545 31.4266L31.5745 24.8008C37.5478 24.0478 41.162 26.8588 41.7141 27.3106H41.8145C41.8145 27.3608 41.8145 27.3608 41.8145 27.3608L43.2702 28.6157C43.2702 28.6157 48.6412 33.2337 44.8765 38.4541L45.8302 39.2572L47.9886 36.2957C47.9886 36.2957 48.9925 34.8902 49.6451 33.1835C50.5486 30.6235 50.649 26.3066 45.9306 22.2408L32.4278 10.6455C32.4278 10.6455 30.8718 9.29018 30.3196 8.63763C29.8678 8.13567 29.1149 7.23214 29.0647 6.12782C29.0145 5.1741 29.4663 4.37096 30.169 3.36704L30.42 3.01567H60.7886V61.2933L60.6882 61.3937Z"
              fill="white"
            />
          </g>
          <defs>
            <clipPath id="clip0_812_12196">
              <rect
                width="64"
                height="64"
                fill="white"
                transform="translate(0 0.254883)"
              />
            </clipPath>
          </defs>
        </svg>
      </router-link>
      <p class="resp-items--hint">
        بلغنا في الجبيري للمحاماة مكانة مرموقة في تقديم الخدمات القانونية،
        مستندين إلى رؤيتنا التي تجمع بين الالتزام الصارم بالمعايير القانونية
        والتمسك بالقيم الإنسانية، مما يعكس أسلوبنا في تحقيق العدالة وتلبية
        احتياجات عملائنا باحترافية وأخلاقية.
      </p>
      <ul class="resp-items">
        <li>
          <button
            type="button"
            class="nav-link w-100 d-flex justify-content-between align-items-center"
            data-bs-toggle="collapse"
            data-bs-target="#demo3"
          >
            <p style="width: fit-content" class="m-0 p-0 resp-items--title">
              الشركة
            </p>
            <svg
              fill="#fff"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 448 512"
              style="width: 1.6rem; height: 1.6rem"
            >
              <path
                d="M201.4 374.6c12.5 12.5 32.8 12.5 45.3 0l160-160c12.5-12.5 12.5-32.8 0-45.3s-32.8-12.5-45.3 0L224 306.7 86.6 169.4c-12.5-12.5-32.8-12.5-45.3 0s-12.5 32.8 0 45.3l160 160z"
              />
            </svg>
          </button>
          <ul id="demo3" class="collapse" style="list-style: none">
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >الصفحة الرئيسية</router-link
              >
            </li>
            <li>
              <router-link to="" class="nav-sub-item pb-4"
                >عن الجبيري</router-link
              >
            </li>
            <li>
              <router-link to="" class="nav-sub-item pb-4"
                >الإنجازات</router-link
              >
            </li>
            <li>
              <router-link to="" class="nav-sub-item pb-4"
                >فريق العمل</router-link
              >
            </li>
            <li>
              <router-link to="" class="nav-sub-item pb-4"
                >التوظيف
              </router-link>
            </li>
          </ul>
        </li>
      </ul>
      <ul class="resp-items">
        <li>
          <button
            type="button"
            class="nav-link w-100 d-flex justify-content-between align-items-center"
            data-bs-toggle="collapse"
            data-bs-target="#demo4"
          >
            <p style="width: fit-content" class="m-0 p-0 resp-items--title">
              استكشف المزيد
            </p>
            <svg
              fill="#fff"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 448 512"
              style="width: 1.6rem; height: 1.6rem"
            >
              <path
                d="M201.4 374.6c12.5 12.5 32.8 12.5 45.3 0l160-160c12.5-12.5 12.5-32.8 0-45.3s-32.8-12.5-45.3 0L224 306.7 86.6 169.4c-12.5-12.5-32.8-12.5-45.3 0s-12.5 32.8 0 45.3l160 160z"
              />
            </svg>
          </button>
          <ul id="demo4" class="collapse" style="list-style: none">
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >المجتمع
              </router-link>
            </li>
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >المدونة</router-link
              >
            </li>
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >الأسئلة المتكررة
              </router-link>
            </li>
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >تواصل معنا</router-link
              >
            </li>
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >دليل الموقع</router-link
              >
            </li>
          </ul>
        </li>
      </ul>
      <ul class="resp-items">
        <li>
          <button
            type="button"
            class="nav-link w-100 d-flex justify-content-between align-items-center"
            data-bs-toggle="collapse"
            data-bs-target="#demo5"
          >
            <p style="width: fit-content" class="m-0 p-0 resp-items--title">
              خدماتنا
            </p>
            <svg
              fill="#fff"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 448 512"
              style="width: 1.6rem; height: 1.6rem"
            >
              <path
                d="M201.4 374.6c12.5 12.5 32.8 12.5 45.3 0l160-160c12.5-12.5 12.5-32.8 0-45.3s-32.8-12.5-45.3 0L224 306.7 86.6 169.4c-12.5-12.5-32.8-12.5-45.3 0s-12.5 32.8 0 45.3l160 160z"
              />
            </svg>
          </button>
          <ul id="demo5" class="collapse" style="list-style: none">
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >الخدمات الأساسيَّة
              </router-link>
            </li>
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >خدمات الهيئات الحكوميَّة
              </router-link>
            </li>
            <li>
              <router-link to="" class="nav-sub-item mt-4 pb-4"
                >خدمات قطاع الأعمال
              </router-link>
            </li>
          </ul>
        </li>
      </ul>

      <ul class="social-icons flx-r" style="list-style: none">
        <li>
          <a href="#" class="social-icon">
            <svg
              width="24"
              height="25"
              viewBox="0 0 24 25"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M21.8256 9.15192C21.7028 7.91582 21.4385 6.54935 20.4655 5.83124C19.712 5.27437 18.7215 5.25378 17.7969 5.25492C15.8422 5.25606 13.8865 5.25836 11.9319 5.2595C10.0519 5.26179 8.17183 5.26294 6.2918 5.26522C5.50645 5.26637 4.74302 5.20234 4.01361 5.55682C3.3873 5.86098 2.897 6.43957 2.60194 7.08335C2.19281 7.9787 2.10726 8.99298 2.0579 9.98324C1.96686 11.7865 1.97673 13.5944 2.08532 15.3965C2.16539 16.7115 2.36831 18.1648 3.34342 19.003C4.20775 19.7451 5.42747 19.7817 6.54847 19.7829C10.1067 19.7863 13.666 19.7898 17.2254 19.792C17.6817 19.7932 18.1577 19.784 18.6228 19.7314C19.5376 19.6285 20.4096 19.3552 20.9975 18.6486C21.5909 17.9362 21.7434 16.9448 21.8333 16.006C22.0527 13.7281 22.0505 11.4286 21.8256 9.15192ZM9.87418 15.7167V9.33031L15.1786 12.5229L9.87418 15.7167Z"
                fill="white"
              />
            </svg>
          </a>
        </li>
        <li>
          <a href="#" class="social-icon">
            <svg
              width="24"
              height="25"
              viewBox="0 0 24 25"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M23.9548 11.1846C23.7005 8.21396 22.3839 5.45818 20.2476 3.4257C18.0984 1.38122 15.3103 0.254883 12.3943 0.254883C5.99451 0.254883 0.787405 5.63833 0.787405 12.2549C0.787405 14.4755 1.37987 16.6388 2.50159 18.5231L0 24.2482L8.00947 23.3661C9.40225 23.9559 10.8763 24.2549 12.393 24.2549C12.7919 24.2549 13.2011 24.2335 13.6116 24.1895C13.973 24.1494 14.3383 24.0907 14.6972 24.016C20.0566 22.8963 23.969 17.9786 24 12.3189V12.2549C24 11.8946 23.9845 11.5342 23.9535 11.1859L23.9548 11.1846ZM8.31798 20.8532L3.88664 21.3416L5.20971 18.3109L4.94509 17.9439C4.92573 17.9172 4.90637 17.8906 4.88443 17.8599C3.73561 16.2197 3.12892 14.282 3.12892 12.2562C3.12892 6.97419 7.28532 2.67704 12.3943 2.67704C17.1807 2.67704 21.2377 6.5378 21.6288 11.4662C21.6494 11.7304 21.6611 11.996 21.6611 12.2576C21.6611 12.3323 21.6598 12.4057 21.6585 12.4844C21.5604 16.903 18.5747 20.6557 14.3977 21.6112C14.0788 21.6846 13.7523 21.7406 13.427 21.7767C13.0888 21.8167 12.7416 21.8367 12.3969 21.8367C11.1694 21.8367 9.97666 21.5912 8.84979 21.1054C8.72458 21.0534 8.60194 20.9973 8.48706 20.9399L8.31927 20.8559L8.31798 20.8532Z"
                fill="white"
              />
            </svg>
          </a>
        </li>
        <li>
          <a href="#" class="social-icon">
            <svg
              width="24"
              height="25"
              viewBox="0 0 24 25"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M20.2016 7.07234V10.2954C19.6383 10.2404 18.9064 10.1125 18.0967 9.81586C17.0395 9.42837 16.2526 8.89858 15.7371 8.48836V15.0027L15.724 14.9824C15.7323 15.1116 15.7371 15.2431 15.7371 15.3759C15.7371 18.6109 13.1048 21.2444 9.86856 21.2444C6.6323 21.2444 4 18.6109 4 15.3759C4 12.1408 6.6323 9.50613 9.86856 9.50613C10.1855 9.50613 10.4964 9.53123 10.8002 9.58026V12.7567C10.5084 12.6527 10.1951 12.5965 9.86856 12.5965C8.33654 12.5965 7.08916 13.8426 7.08916 15.3759C7.08916 16.9091 8.33654 18.1553 9.86856 18.1553C11.4006 18.1553 12.648 16.9079 12.648 15.3759C12.648 15.3185 12.6468 15.2611 12.6432 15.2037V2.54443H15.8639C15.8758 2.81711 15.8866 3.09219 15.8986 3.36487C15.9201 3.90186 16.1115 4.41732 16.4451 4.8395C16.8362 5.33582 17.4138 5.91225 18.2247 6.37269C18.9841 6.80204 19.6969 6.98743 20.2016 7.07474V7.07234Z"
                fill="white"
              />
            </svg>
          </a>
        </li>
      </ul>
    </div>
    <div class="footer-resp--terms">
      © 2025 جميع الحقوق محفوظة - بواسطة
      <a href="#" class="link">Mount Wolf</a>
    </div>
  </footer>
</template>

<script setup>
import { useRoute } from "vue-router";
const route = useRoute();
</script>

<style lang="scss" scoped></style>
